[CombatEngineer X2UniversalSoldierClassInfo]
ClassSpecializationTitle="战斗工程师"
ClassSpecializationSummary="当你需要快速响亮地摧毁一些东西，战斗工程师是你的首选。在这个榴弹火箭的大师面前，建筑和盔甲都不堪一击。"

[Dragoon X2UniversalSoldierClassInfo]
ClassSpecializationTitle="龙骑兵"
ClassSpecializationSummary="几年前，用一架小精灵无人机转移外星人火力的想法还只是个梦想。但现在，由于我们的部队受到越来越多的攻击，这个想法必须付诸行动。而龙骑兵便有了用武之地。"

[Hunter X2UniversalSoldierClassInfo]
ClassSpecializationTitle="猎人"
ClassSpecializationSummary="猎人擅长从暗处发起攻击，找到战场定位。他行动很快，能隐蔽在黑暗中的任何角落或屋顶上。"

[FireSupport X2UniversalSoldierClassInfo]
ClassSpecializationTitle="火力支援兵"
ClassSpecializationSummary="利用防守和压制，无论外星人向他们施加什么样的力量，火力支援兵都能胜任并保持阵线。"

[Juggernaut X2UniversalSoldierClassInfo]
ClassSpecializationTitle="主宰者"
ClassSpecializationSummary="顾名思义，这些家伙能施加重型攻击，专注于短程交火。这些家伙最喜欢在他们靠近外星人时欣赏外星人脸上的表情，然后再把他们击杀。"

[Recon X2UniversalSoldierClassInfo]
ClassSpecializationTitle="战斗侦察兵"
ClassSpecializationSummary="越过前线，标记敌军，绘制地形——侦察单位是XCOM在战场上的秘密武器，知道敌人要做什么是打败敌人的第一步。"

[Scrapper X2UniversalSoldierClassInfo]
ClassSpecializationTitle="好战者"
ClassSpecializationSummary="确保你没有失误的最好方法就是当你扣动扳机的时候，枪管对着外星人的脑袋。好战者是近距离的战士，依靠近距离的巨大伤害来赢得胜利。"

[Survivalist X2UniversalSoldierClassInfo]
ClassSpecializationTitle="生存专家"
ClassSpecializationSummary="有些人喜欢战略，有些人喜欢坚实的防御。然而，生存专家靠本能生存，靠运气找到回家的路。当然，这并不意味着他们不能用他们值得信赖的手枪杀死他们的外星人。"

[Sentry X2UniversalSoldierClassInfo]
ClassSpecializationTitle="警卫"
ClassSpecializationSummary="有时候让敌人先犯错误是最好的选择。警卫是监视的专家，等待外星人探出头来，然后一枪爆头留下一团血雾。"

[Pioneer X2UniversalSoldierClassInfo]
ClassSpecializationTitle="开拓者"
ClassSpecializationSummary="在枪林弹雨中，知道有人在背后支援你是件好事。开拓者支援他的队伍，加强防御，为盟友提供增益，如果任务出了问题，他们会帮助伤员，让每个人都能回家."

[CodeBreaker X2UniversalSoldierClassInfo]
ClassSpecializationTitle="破译者"
ClassSpecializationSummary="外星人有很多科技，无人机，机器人，炮塔，中继站。我们有破译者，能确保外星人技术落入他们之手。对于这群书呆子来说，任何防火墙都形同虚设。"

[Protector X2UniversalSoldierClassInfo]
ClassSpecializationTitle="守护者"
ClassSpecializationSummary="盾牌可能是老式的，但它仍然能起作用，即使是对付外星人的新型等离子武器。防护者使用重型盔甲和防御技能使自己成为外星人目标，以保护队友免受伤害。"

[CombatMedic X2UniversalSoldierClassInfo]
ClassSpecializationTitle="战地医生"
ClassSpecializationSummary="让士兵们保持身体健康是战地医生的工作，他们四处奔跑，确保在外星人袭击时能到达任何需要他们的地方。"

[Brawler X2UniversalSoldierClassInfo]
ClassSpecializationTitle="格斗家"
ClassSpecializationSummary="有时你只想刺死外星人。子弹用光了?枪卡壳了?拿起你的刀，把外星人干掉。格斗家会用他的战斗匕首造成致命的伤害，如果谁犯了靠得太近的错误，他会迅速做出反击。"

[Machinist X2UniversalSoldierClassInfo]
ClassSpecializationTitle="机械师"
ClassSpecializationSummary="当一颗瞄准得当的子弹会击碎任何电路板时，为什么还要骇入敌人的系统？不管他们在这东西上打了多少层装甲，机械师都能找到解决办法。对变种人机器造成巨大的破坏，机械师很快就会让XCOM重拾荣光。"

[Avenger X2UniversalSoldierClassInfo]
ClassSpecializationTitle="复仇者"
ClassSpecializationSummary="利用战场优势，复仇者依靠移动和定位到达正确的位置。然后揭露敌人的弱点，在他们有机会做出反应之前将他们消灭。"

[BigGameHunter X2UniversalSoldierClassInfo]
ClassSpecializationTitle="巨兽猎人"
ClassSpecializationSummary="它们越大，摔得越重!这是巨兽猎人们在野外时的格言。这些家伙去寻找他们能找到的最大最卑鄙的外星人，并确保是这些敌人先倒下。"

[Mercenary X2UniversalSoldierClassInfo]
ClassSpecializationTitle="雇佣兵"
ClassSpecializationSummary="能雇佣的武力?很好，我们正需要。这些中程作战能力强的士兵拥有多种技能，弹药满载，他们的专长是确保外星人每天吃几颗子弹。"

[Bomber X2UniversalSoldierClassInfo]
ClassSpecializationTitle="轰炸兵"
ClassSpecializationSummary="轰炸兵的座右铭是：炸开盖子烧光光。 这种轰炸兵专门研究爆炸物和可燃物，为对抗外星人提供了多样化的前线力量。"

[Assassin X2UniversalSoldierClassInfo]
ClassSpecializationTitle="刺客"
ClassSpecializationSummary="枪响了，但没人看见。这些远程战斗人员，利用射程和隐蔽性，依靠定位来确保一枪一杀。"